// sites.js — редактируй список тут.
// tags НЕ отображаются, но участвуют в поиске.

console.log("SITES.JS LOADED");

window.SITES_DATA = [
  {
    title: "Bunker 644",
    description: "Приобретите бункер как можно быстрее, так как надвигатеся гороховая катастрофа",
    url: "https://eduardzlobin.github.io/bunker644gorohoviysup/",
    tags: ["Bunker", "Бункер", "644", "горох", "суп", "гороховый", "спасение", "помогите", "help"]
  },
  {
    title: "Питер Гриффин",
    description: "Телеграм канал Питера Гриффина",
    url: "https://t.me/PeterGriffinNews",
    tags: ["Грифин", "пидар", "пидор", "петер", "пэтэр", "пэтер", "петэр", "Peter", "Piter", "Griffin", "Grifin", "Pidor", "news", "новости"]
  },
  {
    title: "Личка Эдуарда Злобина",
    description: "Личный аккаунт Эдуарда Злобина",
    url: "https://t.me/eduardzlobifagot",
    tags: ["Эдик", "пидар", "эдуард", "злобин", "приветь", "злобак", "педофил", "педик", "горох", "гороховый суп", "вера", "икона", "шизофреник", "больной", "решетников"]
  },
  {
    title: "Joker Bank",
    description: "Наш Банк принимает только лучшие валюты! 1. Палестинские мальчики - На вашей карте могут храниться...",
    url: "https://joke-bank.webnode.page/",
    tags: ["джокер", "банк", "карта", "мошенники", "взлом", "палестина", "доллар", "$", "грязные бумажки", "кредит", "наёб", "наебалово", "хранилище", "сперма", "спермы"]
  },
  {
    title: "Интерпол",
    description: "Интерпол (Международная организация полиции) – это международная организация, созданная...",
    url: "https://interpol.webnode.page",
    tags: ["джокер", "Пидер", "Гриффин", "грифин", "питер", "петер", "пэтэр", "Гладун", "Дима", "Димка", "Тапочный монстр", "Тревор", "Халк", "патрик", "розыск"]
  },
  {
    title: "TrumpSlops",
    description: "Покупка кейсов со скинами на Танки, Ракеты, Торпеды, Подлодки, Ядерные бомбы...",
    url: "https://trumpslops.webnode.page",
    tags: ["Трамп", "Слотс", "Казино", "Деп", "Кейсы", "Ракеты", "Бомбы", "Ядерная", "Бомба", "Ракета", "Тополь", "Орешник", "пюрешник", "Путин", "сво"]
  },
  {
    title: "В поддержку",
    description: "Сайт создан Ренатом Садиком с целью заработать как можно...",
    url: "https://v-podderzku-4.webnode.page",
    tags: ["Джокер", "Трамп", "Тревор", "тайлер", "светлоликий", "Гладун", "Димка", "мориарти", "питер", "гриффин", "помощь", "help"]
  },
  {
    title: "Википедия",
    description: "На Википедия вы можете писать статьи на любые темы: от науки и технологий до искусства, культуры, философ...",
    url: "https://eduardzlobin.github.io/wikibyedik/#/",
    tags: ["википедия", "википедикя", "Wikipedika", "ренат", "светлоликий", "вера", "религия", "пицца", "пица", "писся", "пися", "обучение", "Дробление пакетов"]
  },
  {
    title: "Он вам не Байден",
    description: "Петиция за свержение Байдена! Вторая сторона демократов...",
    url: "https://on-vam-ne-bajden-7.webnode.page/?_gl=1*2300nf*_gcl_au*NzA3ODM4OTExLjE3NjQ3NjcxNjE.",
    tags: ["бетмен", "байден", "свержение", "против байдена", "маразм", "деменция"]
  },
  {
    title: "YouTube",
    description: "Смотреть любые видео Димки Гладуна...",
    url: "https://www.youtube.com",
    tags: ["ютубеб", "ютуб", "DIMKA", "WOT"]
  },
  {
    title: "ClubID",
    description: "Создайте свой аккаунт на ClubID",
    url: "https://www.youtube.com",
    tags: ["Клуб", "айди", "аккаунт", "регистрация"]
  },
  {
    title: "Котелок Злобина | Огонёк",
    description: "Спасите мир от гибели",
    url: "https://eduardzlobin.github.io/Apocalypse/",
    tags: ["Эдик", "пидар", "эдуард", "злобин", "приветь", "злобак", "педофил", "педик", "горох", "гороховый суп", "Котёл", "Огонь", "Огонёк", "Конец света", "огонек", "таймер"]
  },
  {
    title: "То самое что вы ищите",
    description: "Всё что заприщено везде, доступно тут",
    url: "https://renat25sad-cpu.github.io/prank/",
    tags: ["порно", "прон", "читы", "взлом", "админ", "пиратство", "18+", "+18", "porn", "pron", "моды", "майнкрафт"]
  },
  {
    title: "RadioGladoon",
    description: "лучшее радио в мире",
    url: "https://eduardzlobin.github.io/RadioGladoon/",
    tags: ["Radio", "Gladoon", "Гладун", "музыка", "трансляция", "радио"]
  },
  {
    title: "THELASTSIGNAL",
    description: "Срочные новости...",
    url: "https://eduardzlobin.github.io/THELASTSIGNALB/",
    tags: ["новости", "news", "пицемания", "pi33emania", "SIGNAL", "сигнал", "снн", "CNN"]
  }
];


console.log("SITES COUNT:", window.SITES_DATA.length);
